cf_billing/Reports/бестОборотнаяВедомостьДЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бестОборотнаяВедомостьДЗ</Name>
		</Properties>
	</Report>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестВзаиморасчетыПоМесяцамЭЭ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестВзаиморасчетыПоМесяцамЭЭ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>IDСтрокиОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестПлатежныйДокумент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестВзаиморасчетыПоПениЭЭ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестВзаиморасчетыПоПениЭЭ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>IDСтрокиОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестПлатежныйДокумент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестВзаиморасчетыЭЭ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестВзаиморасчетыЭЭ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестСуммыОплатЭЭ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестСуммыОплатЭЭ</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИсточникиПоступления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестАвансыЭЭ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестАвансыЭЭ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестПлатежноеПоручениеВходящееЭЭЮрЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDСтрокиОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестАвансыИспользованныеЭЭ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестАвансыИспользованныеЭЭ</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестПлатежноеПоручениеВходящееЭЭЮрЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDСтрокиОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестПлатежныйДокумент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/Reports/бестОборотнаяВедомостьДЗ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция СформироватьТабличныйДокумент(Период, Организация, Район, АбонентскийОтдел, Договор, ВариантОтчета) Экспорт
	ТабДок	= Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса();

	Если Не ЗначениеЗаполнено(Договор) Тогда    
		Запрос.Текст	= СтрЗаменить(Запрос.Текст, "бестАвансыИспользованныеЭЭ.Договор = &Договор", "ИСТИНА");
		Запрос.Текст	= СтрЗаменить(Запрос.Текст, "Договор = &Договор", "ИСТИНА");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(АбонентскийОтдел) Тогда
		Запрос.Текст	= СтрЗаменить(Запрос.Текст, "энргДоговорыКонтрагентов.Филиал = &АбонентскийОтдел", "ИСТИНА");
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("АбонентскийОтдел",	АбонентскийОтдел);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("Договор",			Договор);
	Запрос.УстановитьПараметр("Начало",				Новый Граница(Период.ДатаНачала, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Конец",				Новый Граница(Период.ДатаОкончания, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Начало2",			Период.ДатаНачала);
	Запрос.УстановитьПараметр("Конец2",				Период.ДатаОкончания); 
	
	ОснованаяРеализация	= Истина;
	Пени				= Истина;
		
	Если ВариантОтчета = 0 Тогда
		Пени				= Ложь;
	ИначеЕсли ВариантОтчета = 1 Тогда
		ОснованаяРеализация	= Ложь;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ОснованаяРеализация",	ОснованаяРеализация);
	Запрос.УстановитьПараметр("Пени",					Пени);

	Макет			= ПолучитьМакет("Макет"); 
	
	ОбластьЗаголовок			= Макет.Получитьобласть("Заголовок");
	
	ОбластьШапкаНачало			= Макет.Получитьобласть("ШапкаНачало");
	ОбластьШапкаЗадолженность	= Макет.Получитьобласть("ШапкаЗадолженность");
	ОбластьШапкаОбороты			= Макет.Получитьобласть("ШапкаОбороты");
	ОбластьШапкаКонец			= Макет.Получитьобласть("ШапкаКонец");
	
	ОбластьСтрокаНачало			= Макет.Получитьобласть("СтрокаНачало");
	ОбластьСтрокаЗадолженность	= Макет.Получитьобласть("СтрокаЗадолженность");
	ОбластьСтрокаОбороты		= Макет.Получитьобласть("СтрокаОбороты");
	ОбластьСтрокаКонец			= Макет.Получитьобласть("СтрокаКонец");
	
	ОбластьГруппаНачало			= Макет.Получитьобласть("ГруппаНачало");
	ОбластьГруппаЗадолженность	= Макет.Получитьобласть("ГруппаЗадолженность");
	ОбластьГруппаОбороты		= Макет.Получитьобласть("ГруппаОбороты");
	ОбластьГруппаКонец			= Макет.Получитьобласть("ГруппаКонец");
	
	ОбластьИтого				= Макет.Получитьобласть("Итого");
	
	ОбластьЗаголовок.Параметры.Начало			= Формат(Период.ДатаНачала, "ДЛФ=D"); 
	ОбластьЗаголовок.Параметры.Конец			= Формат(Период.ДатаОкончания, "ДЛФ=D");
	ОбластьЗаголовок.Параметры.Организация		= Организация;
	ОбластьЗаголовок.Параметры.Район			= Район;
	ОбластьЗаголовок.Параметры.Договор			= Договор;
    ТабДок.Вывести(ОбластьЗаголовок);

	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаПериодов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период", "ВСЕ");
	
	ТабДок.Вывести(ОбластьШапкаНачало);
	// выводим шапку
	Пока ВыборкаПериодов.Следующий() Цикл
		ОбластьШапкаЗадолженность.Параметры.Период	= Формат(ВыборкаПериодов.Период, "ДЛФ=DD");
		ТабДок.Присоединить(ОбластьШапкаЗадолженность);
		ТабДок.Присоединить(ОбластьШапкаОбороты);
	КонецЦикла;
	
	ОбластьШапкаЗадолженность.Параметры.Период	= Формат(Период.ДатаОкончания, "ДЛФ=DD");
	ТабДок.Присоединить(ОбластьШапкаЗадолженность);
	ТабДок.Присоединить(ОбластьШапкаКонец); 
	
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаИтог	= РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИтог.Следующий() Цикл
		
		ВыборкаБюджета	= ВыборкаИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаБюджета.Следующий() Цикл
			ЗаполнитьСтроку(ВыборкаБюджета, ОбластьГруппаНачало, ОбластьГруппаЗадолженность, ОбластьГруппаОбороты, ОбластьГруппаКонец, ТабДок);
			
			ВыборкаКонтрагент = ВыборкаБюджета.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКонтрагент.Следующий() Цикл
					
				ВыборкаДоговор = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаДоговор.Следующий() Цикл    
					ЗаполнитьСтроку(ВыборкаДоговор, ОбластьСтрокаНачало, ОбластьСтрокаЗадолженность, ОбластьСтрокаОбороты, ОбластьСтрокаКонец, ТабДок)
				КонецЦикла; 
			КонецЦикла;
		КонецЦикла;
		
		ТабДок.ЗакончитьАвтогруппировкуСтрок();
		
		ЗаполнитьСтроку(ВыборкаИтог, ОбластьИтого, ОбластьГруппаЗадолженность, ОбластьГруппаОбороты, ОбластьГруппаКонец, ТабДок)
		
	КонецЦикла;	
	
	ТабДок.ФиксацияСверху = 6;
	Возврат ТабДок;
	
КонецФункции       

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСтроку(Выборка, ОбластьСтрокаНачало, ОбластьСтрокаЗадолженность, ОбластьСтрокаОбороты, ОбластьСтрокаКонец, ТабДок)
	ЗаполнитьЗначенияСвойств(ОбластьСтрокаНачало.Параметры, Выборка);
	ТабДок.Вывести(ОбластьСтрокаНачало, Выборка.Уровень());
	
	ВыборкаПериодов = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период", "ВСЕ");
	Пока ВыборкаПериодов.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаЗадолженность.Параметры, ВыборкаПериодов);
		ОбластьСтрокаЗадолженность.Параметры.Задолженность		= ВыборкаПериодов.ДтНачальныйОстаток - ВыборкаПериодов.КтНачальныйОстаток;
		ТабДок.Присоединить(ОбластьСтрокаЗадолженность);
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаОбороты.Параметры, ВыборкаПериодов);
		ТабДок.Присоединить(ОбластьСтрокаОбороты);
		
	КонецЦикла;
	
	ОбластьСтрокаЗадолженность.Параметры.Задолженность			= Выборка.ДтКонечныйОстаток - Выборка.КтКонечныйОстаток;
	ОбластьСтрокаЗадолженность.Параметры.ДтНачальныйОстаток		= Выборка.ДтКонечныйОстаток;
	ОбластьСтрокаЗадолженность.Параметры.КтНачальныйОстаток		= Выборка.КтКонечныйОстаток;
	ТабДок.Присоединить(ОбластьСтрокаЗадолженность);
	
	ЗаполнитьЗначенияСвойств(ОбластьСтрокаКонец.Параметры, Выборка);
	ТабДок.Присоединить(ОбластьСтрокаКонец);
КонецПроцедуры

Функция ПолучитьТекстЗапроса()
	
	Текст =
	"ВЫБРАТЬ
	|	бестВзаиморасчетыЭЭОстаткиИОбороты.Период КАК Период,
	|	бестВзаиморасчетыЭЭОстаткиИОбороты.Договор.Контрагент КАК ДоговорКонтрагент,
	|	бестВзаиморасчетыЭЭОстаткиИОбороты.Договор КАК Договор,
	|	СУММА(бестВзаиморасчетыЭЭОстаткиИОбороты.СуммаНачальныйОстаток) КАК СуммаНачальныйОстаток,
	|	0 КАК Начислено,
	|	0 КАК Оплачено,
	|	СУММА(бестВзаиморасчетыЭЭОстаткиИОбороты.СуммаРасход) КАК ОплаченоДт,
	|	СУММА(бестВзаиморасчетыЭЭОстаткиИОбороты.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток,
	|	0 КАК КтНачальныйОстаток,
	|	0 КАК КтКонечныйОстаток
	|ПОМЕСТИТЬ ОбщиеДанные
	|ИЗ
	|	РегистрНакопления.бестВзаиморасчетыПоМесяцамЭЭ.ОстаткиИОбороты(
	|			&начало,
	|			&Конец,
	|			Месяц,
	|			,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Договор = &Договор) КАК бестВзаиморасчетыЭЭОстаткиИОбороты
	|ГДЕ
	|	&ОснованаяРеализация
	|
	|СГРУППИРОВАТЬ ПО
	|	бестВзаиморасчетыЭЭОстаткиИОбороты.Период,
	|	бестВзаиморасчетыЭЭОстаткиИОбороты.Договор,
	|	бестВзаиморасчетыЭЭОстаткиИОбороты.Договор.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестВзаиморасчетыПоПениЭЭОстаткиИОбороты.Период,
	|	бестВзаиморасчетыПоПениЭЭОстаткиИОбороты.Договор.Контрагент,
	|	бестВзаиморасчетыПоПениЭЭОстаткиИОбороты.Договор,
	|	СУММА(бестВзаиморасчетыПоПениЭЭОстаткиИОбороты.СуммаНачальныйОстаток),
	|	0,
	|	0,
	|	СУММА(бестВзаиморасчетыПоПениЭЭОстаткиИОбороты.СуммаРасход),
	|	СУММА(бестВзаиморасчетыПоПениЭЭОстаткиИОбороты.СуммаКонечныйОстаток),
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.бестВзаиморасчетыПоПениЭЭ.ОстаткиИОбороты(
	|			&начало,
	|			&Конец,
	|			Месяц,
	|			,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Договор = &Договор) КАК бестВзаиморасчетыПоПениЭЭОстаткиИОбороты
	|ГДЕ
	|	&Пени
	|
	|СГРУППИРОВАТЬ ПО
	|	бестВзаиморасчетыПоПениЭЭОстаткиИОбороты.Период,
	|	бестВзаиморасчетыПоПениЭЭОстаткиИОбороты.Договор,
	|	бестВзаиморасчетыПоПениЭЭОстаткиИОбороты.Договор.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестВзаиморасчетыЭЭОстаткиИОбороты.Период,
	|	бестВзаиморасчетыЭЭОстаткиИОбороты.Договор.Контрагент,
	|	бестВзаиморасчетыЭЭОстаткиИОбороты.Договор,
	|	0,
	|	СУММА(бестВзаиморасчетыЭЭОстаткиИОбороты.СуммаПриход),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.бестВзаиморасчетыЭЭ.ОстаткиИОбороты(
	|			&начало,
	|			&Конец,
	|			Месяц,
	|			,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Договор = &Договор) КАК бестВзаиморасчетыЭЭОстаткиИОбороты
	|ГДЕ
	|	&ОснованаяРеализация
	|
	|СГРУППИРОВАТЬ ПО
	|	бестВзаиморасчетыЭЭОстаткиИОбороты.Договор,
	|	бестВзаиморасчетыЭЭОстаткиИОбороты.Договор.Контрагент,
	|	бестВзаиморасчетыЭЭОстаткиИОбороты.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестСуммыОплатЭЭОбороты.Период,
	|	бестСуммыОплатЭЭОбороты.Договор.Контрагент,
	|	бестСуммыОплатЭЭОбороты.Договор,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ &ОснованаяРеализация
	|				И &Пени
	|			ТОГДА 0
	|		ИНАЧЕ СУММА(бестСуммыОплатЭЭОбороты.СуммаОборот)
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.бестСуммыОплатЭЭ.Обороты(
	|			&начало,
	|			&Конец,
	|			Месяц,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Договор = &Договор) КАК бестСуммыОплатЭЭОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бестСуммыОплатЭЭОбороты.Договор,
	|	бестСуммыОплатЭЭОбороты.Договор.Контрагент,
	|	бестСуммыОплатЭЭОбороты.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестВзаиморасчетыПоПениЭЭОстаткиИОбороты.Период,
	|	бестВзаиморасчетыПоПениЭЭОстаткиИОбороты.Договор.Контрагент,
	|	бестВзаиморасчетыПоПениЭЭОстаткиИОбороты.Договор,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА &ОснованаяРеализация
	|				И НЕ &Пени
	|			ТОГДА -СУММА(бестВзаиморасчетыПоПениЭЭОстаткиИОбороты.СуммаРасход)
	|		КОГДА НЕ &ОснованаяРеализация
	|				И &Пени
	|			ТОГДА СУММА(бестВзаиморасчетыПоПениЭЭОстаткиИОбороты.СуммаРасход)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.бестВзаиморасчетыПоПениЭЭ.ОстаткиИОбороты(
	|			&начало,
	|			&Конец,
	|			Месяц,
	|			,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Договор = &Договор) КАК бестВзаиморасчетыПоПениЭЭОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бестВзаиморасчетыПоПениЭЭОстаткиИОбороты.Период,
	|	бестВзаиморасчетыПоПениЭЭОстаткиИОбороты.Договор,
	|	бестВзаиморасчетыПоПениЭЭОстаткиИОбороты.Договор.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестАвансыЭЭОстаткиИОбороты.Период,
	|	бестАвансыЭЭОстаткиИОбороты.Договор.Контрагент,
	|	бестАвансыЭЭОстаткиИОбороты.Договор,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(бестАвансыЭЭОстаткиИОбороты.СуммаНачальныйОстаток),
	|	СУММА(бестАвансыЭЭОстаткиИОбороты.СуммаКонечныйОстаток)
	|ИЗ
	|	РегистрНакопления.бестАвансыЭЭ.ОстаткиИОбороты(
	|			&начало,
	|			&Конец,
	|			Месяц,
	|			,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Договор = &Договор) КАК бестАвансыЭЭОстаткиИОбороты
	|ГДЕ
	|	&ОснованаяРеализация
	|
	|СГРУППИРОВАТЬ ПО
	|	бестАвансыЭЭОстаткиИОбороты.Период,
	|	бестАвансыЭЭОстаткиИОбороты.Договор.Контрагент,
	|	бестАвансыЭЭОстаткиИОбороты.Договор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(бестАвансыИспользованныеЭЭ.Период, МЕСЯЦ),
	|	бестАвансыИспользованныеЭЭ.Договор.Контрагент,
	|	бестАвансыИспользованныеЭЭ.Договор,
	|	0,
	|	0,
	|	0,
	|	СУММА(бестАвансыИспользованныеЭЭ.Сумма),
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.бестАвансыИспользованныеЭЭ КАК бестАвансыИспользованныеЭЭ
	|ГДЕ
	|	бестАвансыИспользованныеЭЭ.Период МЕЖДУ &начало2 И &Конец2
	|	И ВЫБОР
	|			КОГДА бестАвансыИспользованныеЭЭ.ДокументОплаты.Дата ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ бестАвансыИспользованныеЭЭ.ДокументОплаты.Дата >= &начало2
	|		КОНЕЦ
	|	И бестАвансыИспользованныеЭЭ.Организация = &Организация
	|	И бестАвансыИспользованныеЭЭ.Район = &Район
	|	И бестАвансыИспользованныеЭЭ.Договор = &Договор
	|
	|СГРУППИРОВАТЬ ПО
	|	бестАвансыИспользованныеЭЭ.Договор.Контрагент,
	|	бестАвансыИспользованныеЭЭ.Договор,
	|	НАЧАЛОПЕРИОДА(бестАвансыИспользованныеЭЭ.Период, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестВзаиморасчетыПоМесяцамЭЭОстатки.Договор КАК Договор,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бестВзаиморасчетыПоМесяцамЭЭОстатки.ПлатежныйДокумент) КАК КоличествоПД,
	|	МАКСИМУМ(РАЗНОСТЬДАТ(бестВзаиморасчетыПоМесяцамЭЭОстатки.ПериодНачисления, &Конец2, МЕСЯЦ)) + 1 КАК ПериодНачисления,
	|	СУММА(бестВзаиморасчетыПоМесяцамЭЭОстатки.СуммаОстаток) КАК СуммаОстаток
	|ПОМЕСТИТЬ ПериодыПД
	|ИЗ
	|	РегистрНакопления.бестВзаиморасчетыПоМесяцамЭЭ.Остатки(
	|			&Конец,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Договор = &Договор) КАК бестВзаиморасчетыПоМесяцамЭЭОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	бестВзаиморасчетыПоМесяцамЭЭОстатки.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбщиеДанные.Период КАК Период,
	|	энргДоговорыКонтрагентов.Контрагент КАК ДоговорКонтрагент,
	|	ОбщиеДанные.Договор.Номер КАК Договор,
	|	ОбщиеДанные.Договор КАК ДоговорСсылка,
	|	СУММА(ОбщиеДанные.СуммаНачальныйОстаток) КАК ДтНачальныйОстаток,
	|	СУММА(ОбщиеДанные.КтНачальныйОстаток) КАК КтНачальныйОстаток,
	|	СУММА(ОбщиеДанные.Начислено) КАК Начислено,
	|	СУММА(ОбщиеДанные.Оплачено) КАК Оплачено,
	|	СУММА(ОбщиеДанные.ОплаченоДт) КАК ОплаченоДт,
	|	СУММА(ОбщиеДанные.Оплачено - ОбщиеДанные.ОплаченоДт) КАК ОплаченоКт,
	|	СУММА(ОбщиеДанные.СуммаКонечныйОстаток) КАК ДтКонечныйОстаток,
	|	СУММА(ОбщиеДанные.КтКонечныйОстаток) КАК КтКонечныйОстаток,
	|	МАКСИМУМ(ПериодыПД.КоличествоПД) КАК КоличествоПД,
	|	МАКСИМУМ(ПериодыПД.ПериодНачисления) КАК КоличествоПериодов,
	|	СУММА(ОбщиеДанные.СуммаНачальныйОстаток) - СУММА(ОбщиеДанные.КтНачальныйОстаток) КАК Задолженность,
	|	СУММА(ОбщиеДанные.СуммаКонечныйОстаток) - СУММА(ОбщиеДанные.КтКонечныйОстаток) КАК ЗадолженностьКонечныйОстаток,
	|	энргДоговорыКонтрагентов.ГруппаФинансирования КАК ГруппаФинансирования
	|ИЗ
	|	ОбщиеДанные КАК ОбщиеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыПД КАК ПериодыПД
	|		ПО ОбщиеДанные.Договор = ПериодыПД.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ПО ОбщиеДанные.Договор = энргДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	энргДоговорыКонтрагентов.Филиал = &АбонентскийОтдел
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбщиеДанные.Период,
	|	ОбщиеДанные.Договор.Ссылка,
	|	энргДоговорыКонтрагентов.Контрагент,
	|	энргДоговорыКонтрагентов.ГруппаФинансирования,
	|	ОбщиеДанные.Договор,
	|	ОбщиеДанные.Договор.Номер
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГруппаФинансирования,
	|	ДоговорКонтрагент,
	|	ДоговорСсылка,
	|	Период
	|ИТОГИ
	|	СУММА(ДтНачальныйОстаток),
	|	СУММА(КтНачальныйОстаток),
	|	СУММА(Начислено),
	|	СУММА(Оплачено),
	|	СУММА(ОплаченоДт),
	|	СУММА(ОплаченоКт),
	|	СУММА(ДтКонечныйОстаток),
	|	СУММА(КтКонечныйОстаток),
	|	МАКСИМУМ(КоличествоПД),
	|	МАКСИМУМ(КоличествоПериодов),
	|	СУММА(Задолженность),
	|	СУММА(ЗадолженностьКонечныйОстаток)
	|ПО
	|	ОБЩИЕ,
	|	ГруппаФинансирования,
	|	ДоговорКонтрагент,
	|	ДоговорСсылка,
	|	Период ПЕРИОДАМИ(МЕСЯЦ, , )"; 
	
	Возврат Текст;  
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
